{ "books": [{
    "title": "Geekerella",
    "author": "Veruca Salt",
    "img": "https://typeset-beta.imgix.net/2017/3/21/46b8fa71-e459-44ed-8cf3-e685e8bb9e0a.jpg?w=740&h=437&fit=crop&crop=faces&auto=format&q=70",
    "description": "We all love a good geeky story every now and again. But when young adult fandom and fairytale collide? Let's just say we're mildly obsessed with the idea. And Ashley Poston's latest, ",
    "story": "We all love a good geeky story every now and again. But when young adult fandom and fairytale collide? Let's just say we're mildly obsessed with the idea. And Ashley Poston's latest, Geekerella, is the Cinderella retelling of your fangirl/fanboy dreams.The story follows Elle Wittimer who lives and breathes Starfield, the classic sci-fi series she grew up watching with her late father. Living with her aloof stepmother and selfish stepsisters isn't easy, but the fandom is a place she can always escape to. So when she sees a cosplay contest for a new Starfield movie, she has to enter. The prize is an invitation to the ExcelsiCon Cosplay Ball, and a meet-and-greet with the actor slated to play Federation Prince Carmindor in the reboot. With savings from her gig at the Magic Pumpkin food truck (and her dad’s old costume), Elle’s determined to win…u nless her stepsisters get there first. Teen actor Darien Freeman used to live for cons — before he was famous. Now they’re nothing but autographs and awkward meet-and-greets. Playing Carmindor is all he’s ever wanted, but the Starfield fandom has written him off as just another dumb heartthrob. As ExcelsiCon draws near, Darien feels more and more like a fake — until he meets a girl who shows him otherwise. But when she disappears at midnight, he worries he might never be able to find her again.Fairytale and fandom collide in this sweet, heartfelt, entertaining rom-com. If you've ever fangirled/fanboyed over anything, you will definitely relate to and root for Elle and Darien. And that's no mistake. Because Ashley Poston knows what it's like to *squee* over her faves, too."
  }, {
    "title": "This New Sorting Hat",
    "author": "Emma Oulton",
    "img": "https://typeset-beta.imgix.net/2017/3/21/551e3135-c34e-4ac2-b6aa-c083fc83dd1b.jpg?w=740&h=437&fit=crop&crop=faces&auto=format&q=70",
    "description": "If you've ever suddenly sat bolt upright in bed at three in the morning and shouted, 'But why was Peter Pettigrew in Gryffindor?' — you're not alone. It just doesn't add up! But a fan theory about the Sorting Hat may have just answered our questions",
    "story": "If you've ever suddenly sat bolt upright in bed at three in the morning and shouted, 'But why was Peter Pettigrew in Gryffindor?' — you're not alone. It just doesn't add up! But a fan theory about the Sorting Hat may have just answered our questions forever.According to the Harry Potter books, the Sorting Hat divides children up based on qualities: intelligence for Ravenclaw, bravery for Gryffindor, cunning for Slytherin, and, um, everything else for Hufflepuff. As children, we always just accepted that — but on the fifth or sixth re-reading of the books, there are a few things that just don't seem to add up. Like, why is Peter Pettigrew in Gryffindor when he's so spineless? Why are Crabbe and Goyle in Slytherin when they're about as cunning as a panda? And why, for the love of McGonagall, isn't Hermione Granger in Ravenclaw?That's what Reddit user Straw_Boats was wondering, and so came up with this possible solution: the Sorting Hat sorts students based on the qualities they value, rather than the ones they possess.Of course, this isn't totally news. Dumbledore already explained to Harry in Chamber of Secrets that his choice to be in Gryffindor is what defined him as a true Gryff. But Straw_Boats's theory finally connects the rest of the dots."
  }, {
    "title": "7 Reasons Libraries Are Essential",
    "author": "Sadie L. Trombetta",
    "img": "https://typeset-beta.imgix.net/2017/3/13/6a56f12a-b207-4199-b803-2ec76449ccce.jpg?w=740&h=437&fit=crop&crop=faces&auto=format&q=70",
    "description": "I grew up down the street from my local library, so I spent a lot of my childhood there, either hidden away in the stacks reading books, using the internet to access Myspace, or meeting up with friends to work on school projects. I've always understood the value of such an institution, but in today's current climate of untruths",
    "story": "I grew up down the street from my local library, so I spent a lot of my childhood there, either hidden away in the stacks reading books, using the internet to access Myspace, or meeting up with friends to work on school projects. I've always understood the value of such an institution, but in today's current climate of untruths, intolerance, and ignorance, it's becoming clear that libraries are essential, now more than ever.  017 has been dubbed by many the year of resistance, and over the past three months, the country has seen that play out in an increasingly interesting number of ways. There's been no shortage of protests, marches, and strikes, but aside from the traditional demonstrations of civil disobedience, people across the country have come up with new and surprising ways to speak out against the dangerous political agenda of the current administration and stand up for their rights and the rights of others. There have been movements to bury the White House in books, a nationwide call to action for women to get involved in politics, and so much more. While millions of individuals have gotten involved in the resistance, entire institutions have dedicated themselves to it, too, including many libraries around the U.S.Despite what you may hear about the death of print books and the lack of interest in libraries, there are actually more public libraries in the U.S. than there are Starbucks. More than just storage spaces for books, libraries are important community hubs that serve as centers of learning, professional development, healthcare, and now, resistance. In today's political climate, libraries have become centers for the movement that supports women, immigrants, people of color, the LGBTQ community, and those facing religious persecution. They are free public spaces that allow everyone to feel safe and to find opportunity. Now, more than ever, they are vital American institutions, and here are seven reasons why:"
  }],
  "announcements": [{
    "news": "New Article Added",
    "discounts": "New discounts in 2017 for new members"
  }, {
    "news": "Discount for new members",
    "discounts": "New discounts in 2017 for new members"
  }]
}
